Revit 2026 API

# OpenOptions Properties

---

The OpenOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllowOpeningLocalByWrongUser | Specifies whether a local file is allowed to be opened as read-only by a user other than its owner. |
|  | Audit | Specifies whether to expand all elements in order to check for corruption. |
|  | DetachFromCentralOption | An option that specifies whether or not a workset-enabled document is detached from its central document. |
|  | IgnoreExtensibleStorageSchemaConflict | Specifies whether to ignore the error of schema conflict. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OpenForeignOption | An option that specifies how to open files saved by an application that was not developed or licensed by Autodesk. |

#### Reference

OpenOptions Class

Autodesk.Revit.DB Namespace